#+TITLE: Emacs 配置

** 字体

   #+BEGIN_SRC emacs-lisp
   (set-language-environment 'UTF-8)
   (set-locale-environment "UTF-8")
   ;; Emacs 23.1 set-default-font -> set-frame-font
   (set-frame-font "Dejavu Sans Mono 12" nil t)
   (modify-all-frames-parameters (list (cons 'font "Dejavu Sans Mono 12")))
   (set-fontset-font "fontset-default" 'unicode "WenQuanYi Micro Hei Mono 15");
   (setq face-font-rescale-alist '(
                                   ("WenQuanYi Micro Hei Mono" . 1.3)
                                   ))
   #+END_SRC

   #+RESULTS:
   : ((WenQuanYi Micro Hei Mono . 1.3))

** 个人管理
   :PROPERTIES:
   :ID:       845afd72-8703-486f-93da-883c2e9b9be3
   :END:

   设置 =org-capture-bookmark= 为 nil，不要在 bookmarks 里记一个 last stored capture 的特殊书签
   #+begin_src emacs-lisp
   (setq org-capture-bookmark nil)
   #+END_SRC

   设置基础的任务状态关键词，其中 "DONE" 和 "ABORT" 表示终结状态，并且用 "@" 设置为在进入终结状态时，要求输入笔记；用 "!" 设置从终结状态变化为其他状态时自动添加变更信息。
   #+BEGIN_SRC emacs-lisp
   (setq org-use-fast-todo-selection t)
   (setq org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "SOMETIME(s)" "|" "DONE(d@/!)" "ABORT(a@/!)")))
   (setq org-log-done t)
   (setq org-log-into-drawer t)
   (setq org-log-state-notes-insert-after-drawers t)
   #+END_SRC

   任务关键词还可以在具体的文件中用 =#+SEQ_TODO: TODO NEXT | DONE= 这样的方式单独设置。

   此外要求子任务未完成时不能将父任务标记为完成
   #+BEGIN_SRC emacs-lisp
   (setq org-enforce-todo-dependencies t)
   (setq org-enforce-todo-checkbox-dependencies t)
   #+END_SRC

   然后是 org-capture 的模板，我的模板暂时分为以下几个:
   + Inbox: 用来收集基础的未归类的内容

     #+BEGIN_SRC emacs-lisp
     (setq org-capture-templates nil)
     (add-to-list 'org-capture-templates
                  '("i" "Inbox"
                    entry (file "~/Dropbox/org/inbox.org")
                    "* %U - %^{title} %^g\n\n  %?"
                    :empty-lines 1))
     #+END_SRC

   + Task: 用来记录任务

     嗯没错，时隔多年，我又要启用 task 系统了！

     任务统一加到 Inbox 里，然后手工再做分类
     #+BEGIN_SRC emacs-lisp
     (add-to-list 'org-capture-templates '("t" "Tasks"))
     (add-to-list 'org-capture-templates `("ti" "General Task" entry (file "~/Dropbox/org/tasks/inbox.org")
                                           ,(concat "* TODO %^{title}\n"
                                                   "  :PROPERTIES:\n"
                                                   "  :CREATED:   %U\n"
                                                   "  :END:\n\n"
                                                   "  %?")
                                           :empty-lines 1))
     (add-to-list 'org-capture-templates `("tw" "Work Tasks" entry (file "~/Dropbox/org/tasks/work.org")
                                           ,(concat "* TODO %^{title}\n"
                                                   "  :PROPERTIES:\n"
                                                   "  :CREATED:   %U\n"
                                                   "  :END:\n\n"
                                                   "  %?")
                                           :empty-lines 1))
     (add-to-list 'org-capture-templates `("tp" "Personal Tasks" entry (file "~/Dropbox/org/tasks/personal.org")
                                           ,(concat "* TODO %^{title}\n"
                                                    "  :PROPERTIES:\n"
                                                    "  :CREATED:   %U\n"
                                                    "  :END:\n\n"
                                                    "  %?"
                                                    )
                                           :empty-lines 1))
     #+END_SRC

   + Web: 用来收集 web 内容

     用的是 org-protocol
     #+BEGIN_SRC emacs-lisp
     (require 'org-protocol)
     #+END_SRC

     添加一个组模板吧
     #+BEGIN_SRC emacs-lisp
     (add-to-list 'org-capture-templates '("w" "Web"))
     #+END_SRC

     定义一个函数，用来将选中内容插入到同一个 headline 中
     #+BEGIN_SRC emacs-lisp
     (defun org-capture-template-goto-link ()
       (org-capture-put :target (list 'file+headline
                                      (nth 1 (org-capture-get :target))
                                      (org-capture-get :annotation)))
       (org-capture-put-target-region-and-position)
       (widen)
       (let ((heading (nth 2 (org-capture-get :target))))
         (goto-char (point-min))
         (if (re-search-forward
              (format org-complex-heading-regexp-format (regexp-quote heading)) nil t)
             (org-end-of-subtree)
           (goto-char (point-max))
           (or (bolp) (insert "\n"))
           (insert "* " heading "\n"))))
     #+END_SRC

     和 org-protocol 结合来做收集
     #+BEGIN_SRC emacs-lisp
     (add-to-list 'org-capture-templates
                  '("wa" "Web Annotation" plain
                    (file+function "~/Dropbox/org/inbox.org" org-capture-template-goto-link)
                    "  %U %:initial" :empty-lines 1 :immediate-finish t))
     #+END_SRC

     利用 [[https://github.com/alphapapa/org-protocol-capture-html][org-protocol-capture-html]] 来做稍后阅读
     #+BEGIN_SRC emacs-lisp
     (add-to-list 'load-path "~/.emacs.d/site-lisp/org-protocol-capture-html")
     (require 'org-protocol-capture-html)
     #+END_SRC

     #+BEGIN_SRC emacs-lisp
     (defun web-file-to-save ()
       (concat "~/Dropbox/org/web" (org-capture-get :description) ".org"))

     (add-to-list 'org-capture-templates
                  '("wr" "Web Reading" plain
                    (function web-file-to-save)
                    "LINK: %:link\n\n%:initial" :immediate-finish t))
     #+END_SRC

     #+RESULTS:
     | wr | Web Reading | plain | (function web-file-to-save) | LINK: %:link |



     <2018-04-02 一 07:46> 嗯，似乎还没有完成，会让我选文件来着……

   + Notes: 分类明确的笔记内容

     #+BEGIN_SRC emacs-lisp
     (add-to-list 'org-capture-templates
                  '("n" "Notes"
                    entry (file "~/Dropbox/org/notes/inbox.org")
                    "* %^{heading} %t %^g\n  %?\n"
                    :empty-lines 1
                    ))
     #+END_SRC

     #+RESULTS:
     | n | Notes | entry | (file ~/Dropbox/org/notes/inbox.org) | * %^{heading} %t %^g |

   + Journal: 日志

     用来记录自己每天做的事情的具体过程，一般是工作日志
     #+BEGIN_SRC emacs-lisp
     (add-to-list 'org-capture-templates
                  '("j" "Journal"
                    entry (file+olp+datetree "~/Dropbox/org/journal/inbox.org")
                    "* %U - %^{heading} %^g\n  %?\n"
                    :empty-lines 1
                    ))
     #+END_SRC

   + Diary: 日记

     记录每天发生的、了解到的事情
     #+BEGIN_SRC emacs-lisp
     (defun find-today ()
       (let* ((heading (format-time-string "%Y-%m-%d 周%a"))
              end)
         (unless (derived-mode-p 'org-mode)
           (error "Target buffer \"%s\" should be in Org mode" (current-buffer)))
         (goto-char (point-min))             ;移动到 buffer 的开始位置
         (let ((re (format org-complex-heading-regexp-format
                             (regexp-quote heading)))
               (cnt 0))
           (if (re-search-forward re end t)
               (goto-char (point-at-bol))  ;如果找到了 headline 就移动到对应的位置
             (progn                        ;否则就新建一个 headline
               (goto-char (point-max))
               (or (bolp) (insert "\n"))
               (if (/= (point) (point-min)) (org-end-of-subtree t t))
               (insert "* " heading "\n"))))
         (org-end-of-subtree)))

     (add-to-list 'org-capture-templates `("d" "Diary"))
     (add-to-list 'org-capture-templates
                  `("dg" "General"
                    plain (file+function "~/Dropbox/org/diary.org" find-today)
                    "** %<%H:%M> %?"
                    :empty-lines 1))
     (add-to-list 'org-capture-templates
                  `("de" "Emotion"
                    plain (file+function "~/Dropbox/org/diary.org" find-today)
                    ,(concat "** %<%H:%M> 情绪|%^{情绪|快乐|愤怒|恐惧|悲伤}\n\n"
                             "   %?")
                    :empty-lines 1))
     (add-to-list 'org-capture-templates
                  `("dt" "Thought"
                    plain (file+function "~/Dropbox/org/diary.org" find-today)
                    ,(concat "** %<%H:%M> 想法|%?\n\n")
                    :empty-lines 1))
     (add-to-list 'org-capture-templates
                  `("dp" "Plan"
                    plain (file+function "~/Dropbox/org/diary.org" find-today)
                    "** %<%H:%M> 今日计划\n\n   %?"
                    :empty-lines 1))
     (add-to-list 'org-capture-templates
                  `("dr" "Review"
                    plain (file+function "~/Dropbox/org/diary.org" find-today)
                    ,(concat "** %<%H:%M> 今日回顾\n\n"
                             "   - 事项回顾\n\n"
                             "     #+BEGIN: clocktable :scope agenda-with-archives :block today :maxlevel 4 :fileskip0 t\n"
                             "     #+END\n\n"
                             "     %?\n\n"
                             "   - 今日反思\n"
                             "   - 今日收获\n")
                    :empty-lines 1))
     (add-to-list 'org-capture-templates
                  `("dd" "Deal"
                    plain (file+function "~/Dropbox/org/diary.org" find-today)
                    ,(concat "** %<%H:%M> 交易记录: %^{操作|买入|卖出}%^{买卖品种}%^{买卖数量}份\n\n"
                             "   - 操作: %\\1\n"
                             "   - 品种: %\\2\n"
                             "   - 数量: %\\3\n"
                             "   - 买卖理由:\n\n"
                             "     %?\n\n")
                    :empty-lines 1))
     #+END_SRC

   + 每周回顾和下周计划

     TODO

   在上述模板中有时候需要填 tag，我把 tag 的举例设置得大一些，这样当标题比较长的时候不会影响阅读
   #+BEGIN_SRC emacs-lisp
   (setq org-tags-column -100)
   ; (add-hook 'org-capture-mode-hook #'org-align-all-tags)
   #+END_SRC

   Org Brain 设置
   #+BEGIN_SRC emacs-lisp
   (setq org-brain-path "~/Dropbox/org/brain")
   (setq org-id-track-globally t)
   (setq org-id-locations-file "~/Dropbox/org/.org-id-locations")
   #+END_SRC

   然后是 agenda 相关的设置

   首先是一些初始化设置
   #+BEGIN_SRC emacs-lisp
   (require 'org-clock)
   (setq org-agenda-span 'day
         org-agenda-files '("~/Dropbox/org/tasks/")
         ;; org-deadline-warning-days 0
         ;; org-agenda-todo-ignore-deadlines 'far
         org-agenda-todo-ignore-scheduled 'future
         ;; org-agenda-inhibit-startup t
         ;; org-agenda-skip-scheduled-if-done t
         ;; org-agenda-skip-deadline-if-done t
         ;; org-habit-graph-column 80
         org-agenda-block-separator " "
         ;; org-agenda-log-mode-items '(clock)
         ;; org-agenda-log-mode-add-notes nil
         )

   ;; 把 agenda-view 里的按键 k 改成执行 org-capture 而不是 org-agenda-capture
   (add-hook 'org-agenda-mode-hook
             (lambda () (local-set-key (kbd "k") 'org-capture)))
   #+end_src

   然后定义一些函数用于自定义 agenda 视图
   #+begin_src emacs-lisp
   (defun z/get-weekday ()
     (let* ((today (calendar-current-date))
            (weekday (org-day-of-week (nth 1 today) (nth 0 today) (nth 2 today))))
       (if (> weekday 0) weekday 7)))

   (defun z/begin-date-of-current-week ()
     (let* ((weekday (z/get-weekday))
            (offset (- 1 weekday)))
       (org-read-date nil nil (format "+%dd" offset))))

   (defun z/end-date-of-current-week ()
     (let* ((weekday (z/get-weekday))
            (offset (- 7 weekday)))
       (org-read-date nil nil (format "+%dd" offset))))

   (defun z/get-day (property)
     (let ((val (org-entry-get nil property)))
       (if val (time-to-days (org-time-string-to-time val)) nil)))


   ;; (defun z/get-subtasks-num ()
   ;;   (save-excursion
   ;;     (save-restriction
   ;;       (progn
   ;;         (org-back-to-heading)
   ;;         ;; (org-narrow-to-subtree)
   ;;         (org-show-children)
   ;;         (let* ((level (org-current-level))
   ;;                (subheading-level (+ 1 level))
   ;;                (todo-keywords '("TODO" "NEXT" "DONE" "ABORT"))
   ;;                res)
   ;;           (while (and (progn
   ;;                         (outline-next-heading)
   ;;                         (> (org-current-level) level)))
   ;;             (let* ((element (org-heading-components))
   ;;                    (cur-level (org-current-level))
   ;;                    (tags (org-get-tags))
   ;;                    (todo-keyword (nth 2 element)))
   ;;               (when (and (= cur-level subheading-level)
   ;;                          (not (member "ARCHIVE" tags))
   ;;                          (member (substring-no-properties todo-keyword) todo-keywords))
   ;;                 (add-to-list 'res element))))
   ;;           (length res))))))

   (defun z/get-subtasks-num ()
     (save-excursion
       (save-restriction
         (progn
           (org-back-to-heading)
           (org-narrow-to-subtree)
           (org-show-children)
           (let* ((level (org-current-level))
                  (subheading-level (+ 1 level))
                  (todo-keywords '("TODO" "NEXT" "DONE" "ABORT")))
             (length (delq nil
                           (org-map-entries
                            (lambda ()
                              (let ((todo-keyword (org-get-todo-state)))
                                (when (and (= (org-current-level) subheading-level)
                                           todo-keyword
                                           (member (substring-no-properties todo-keyword) todo-keywords))
                                  (org-heading-components))))
                            nil
                            'tree))))))))

   (defun z/get-ancestor-tasks-num ()
     (save-excursion
       (save-restriction
         (let* ((level (org-current-level))
                (cur-level level)
                (todo-keywords '("TODO" "NEXT" "DONE" "ABORT"))
                (ancestors '()))
           (while (> cur-level 1)
             (outline-up-heading 1)
             (let ((todo-keyword (org-get-todo-state)))
               (when (and todo-keyword (member (substring-no-properties todo-keyword) todo-keywords))
                 (push (org-heading-components) ancestors)))
             (setq cur-level (org-current-level)))
           (length ancestors)))))

   (defun z/org-agenda-select (&rest args)
     (let* ((no-subtasks (plist-get args :no-subtasks))
            (no-ancestors (plist-get args :no-ancestors))
            (todo-keywords (plist-get args :todo-keywords))
            (begin-scheduled (plist-get args :begin-scheduled))
            (end-scheduled (plist-get args :end-scheduled))
            (begin-deadline (plist-get args :begin-deadline))
            (end-deadline (plist-get args :end-deadline))
            (begin-scheduled-or-deadline (plist-get args :begin-scheduled-or-deadline))
            (end-scheduled-or-deadline (plist-get args :end-scheduled-or-deadline))
            (begin-scheduled-date (cond ((null begin-scheduled) nil)
                                        ((string= begin-scheduled "ws") (z/begin-date-of-current-week))
                                        ((string= begin-scheduled "we") (z/end-date-of-current-week))
                                        (t (org-read-date nil nil begin-scheduled))))
            (end-scheduled-date (cond ((null end-scheduled) nil)
                                      ((string= end-scheduled "ws") (z/begin-date-of-current-week))
                                      ((string= end-scheduled "we") (z/end-date-of-current-week))
                                      (t (org-read-date nil nil end-scheduled))))
            (begin-deadline-date (cond ((null begin-deadline) nil)
                                       ((string= begin-deadline "ws") (z/begin-date-of-current-week))
                                       ((string= begin-deadline "we") (z/end-date-of-current-week))
                                       (t (org-read-date nil nil begin-deadline))))
            (end-deadline-date (cond ((null end-deadline) nil)
                                     ((string= end-deadline "ws") (z/begin-date-of-current-week))
                                     ((string= end-deadline "we") (z/end-date-of-current-week))
                                     (t (org-read-date nil nil end-deadline))))
            (begin-s-or-d (cond ((null begin-scheduled-or-deadline) nil)
                                ((string= begin-scheduled-or-deadline "ws") (z/begin-date-of-current-week))
                                ((string= begin-scheduled-or-deadline "we") (z/end-date-of-current-week))
                                (t (org-read-date nil nil begin-scheduled-or-deadline))))
            (end-s-or-d (cond ((null end-scheduled-or-deadline) nil)
                              ((string= end-scheduled-or-deadline "ws") (z/begin-date-of-current-week))
                              ((string= end-scheduled-or-deadline "we") (z/end-date-of-current-week))
                              (t (org-read-date nil nil end-scheduled-or-deadline))))
            (next-headline (save-excursion (or (outline-next-heading) (point-max))))
            (subtree-end (save-excursion (org-end-of-subtree t)))
            (todo-keyword (org-get-todo-state))
            (scheduled-day (z/get-day "SCHEDULED"))
            (deadline-day (z/get-day "DEADLINE"))
            (subtasks-num (z/get-subtasks-num))
            (ancestors-num (z/get-ancestor-tasks-num))
            (subtree-valid
             (and (or (not no-subtasks) (= subtasks-num 0))
                  (or (not no-ancestors) (= ancestors-num 0))
                  (or (not todo-keywords) (and todo-keyword
                                               (member (substring-no-properties todo-keyword) todo-keywords)))
                  (or (not begin-scheduled-date)
                      (and scheduled-day
                           (>= scheduled-day (org-time-string-to-absolute begin-scheduled-date))))
                  (or (not end-scheduled-date)
                      (and scheduled-day
                           (<= scheduled-day (org-time-string-to-absolute end-scheduled-date))))
                  (or (not begin-deadline)
                      (and deadline-day
                           (>= deadline-day (org-time-string-to-absolute begin-deadline-date))))
                  (or (not end-deadline-date)
                      (and deadline-day
                           (<= deadline-day (org-time-string-to-absolute end-deadline-date))))
                  (or (not begin-s-or-d)
                      (or (and scheduled-day
                               (>= scheduled-day (org-time-string-to-absolute begin-s-or-d)))
                          (and deadline-day
                               (>= deadline-day (org-time-string-to-absolute begin-s-or-d)))))
                  (or (not end-s-or-d)
                      (or (and scheduled-day
                               (<= scheduled-day (org-time-string-to-absolute end-s-or-d)))
                          (and deadline-day
                               (<= deadline-day (org-time-string-to-absolute end-s-or-d))))))))
       (unless subtree-valid (min next-headline subtree-end))))
   #+END_SRC

   #+RESULTS:
   : z/org-agenda-select

   定义默认视图
   #+begin_src emacs-lisp
   (setq org-agenda-custom-commands
         '(("a" "Customized Agenda View"
            ((agenda "" ((org-agenda-overriding-header "今日事项")
                         (org-agenda-format-date "")
                         (org-scheduled-past-days 0)
                         (org-deadline-warning-days 0)
                         (org-agenda-skip-scheduled-if-done t)
                         (org-agenda-skip-deadline-if-done t)
                         (org-agenda-todo-ignore-deadlines 'far)
                         (org-agenda-todo-ignore-scheduled 'future)
                         (org-agenda-log-mode-add-notes nil)
                         (org-log-note-clock-out t)
                         (org-agenda-sorting-strategy '(time-up priority-down category-keep))
                         (org-agenda-skip-function
                          '(z/org-agenda-select :no-subtasks t
                                                :todo-keywords '("TODO" "NEXT")
                                                :begin-scheduled-or-deadline "today"
                                                :end-scheduled-or-deadline "today"))))
             (todo "" ((org-agenda-overriding-header "本周工作项目")
                       (org-agenda-files '("~/Dropbox/org/tasks/work.org"))
                       (org-log-note-clock-out t)
                       (org-agenda-sorting-strategy '(time-up priority-down category-keep))
                       (org-agenda-skip-function
                        '(z/org-agenda-select :no-ancestors t
                                              :todo-keywords '("TODO" "NEXT" "DONE" "ABORT")
                                              :begin-scheduled-or-deadline "ws"
                                              :end-scheduled-or-deadline "we"))))
             (todo "" ((org-agenda-overriding-header "本周个人项目")
                       (org-agenda-files '("~/Dropbox/org/tasks/personal.org"))
                       (org-log-note-clock-out t)
                       (org-agenda-sorting-strategy '(time-up priority-down category-keep))
                       (org-agenda-skip-function
                        '(z/org-agenda-select :no-ancestors t
                                              :todo-keywords '("TODO" "NEXT" "DONE" "ABORT")
                                              :begin-scheduled-or-deadline "ws"
                                              :end-scheduled-or-deadline "we"))))
             (todo "SOMETIME" ((org-agenda-overriding-header "纯计时任务")))))))

   (defun my-agenda-list ()
     (interactive)
     (progn
       (org-agenda "" "a")
       (delete-other-windows)
       ))
   #+end_src

   #+RESULTS:
   : my-agenda-list

   定义每日回顾视图
   #+begin_src emacs-lisp
   (add-to-list 'org-agenda-custom-commands
                '("l" "Daily Agenda Review"
                  ((agenda "" ((org-agenda-overriding-header "今日记录")
                               (org-agenda-span 'day)
                               (org-agenda-show-log 'clockcheck)
                               (org-agenda-start-with-log-mode nil)
                               (org-agenda-archives-mode t)
                               (org-agenda-log-mode-items '(closed clock))
                               (org-agenda-clockreport-parameter-plist '(:link t :maxlevel 2 :fileskip0 t :scope agenda-with-archives))
                               (org-agenda-clockreport-mode t)
                               (org-agenda-log-mode-add-notes nil)
                               ))
                   )))


   (defun my-agenda-review ()
     (interactive)
     (progn
       (org-agenda "" "l")
       (delete-other-windows)
       ))
   #+end_src

   #+RESULTS:
   : my-agenda-review

   定义看板模式视图
   #+begin_src emacs-lisp
   (add-to-list 'org-agenda-custom-commands
                '("k" "Kanban View"
                  ((agenda "" ((org-agenda-overriding-header "TODO")
                               (org-agenda-format-date "")
                               (org-agenda-span 'day)
                               (org-agenda-time-grid nil)
                               (org-agenda-use-time-grid nil)
                               (org-scheduled-past-days 0)
                               (org-deadline-warning-days 0)
                               (org-agenda-skip-scheduled-if-done t)
                               (org-agenda-skip-deadline-if-done t)
                               (org-log-note-clock-out t)
                               (org-agenda-todo-ignore-scheduled 'future)
                               (org-agenda-skip-function
                                '(z/org-agenda-select :todo-keywords '("TODO")
                                                      :begin-scheduled-or-deadline "today"
                                                      :end-scheduled-or-deadline "today"))))
                   (agenda "" ((org-agenda-overriding-header "NEXT")
                               (org-agenda-format-date "")
                               (org-agenda-span 'day)
                               (org-agenda-time-grid nil)
                               (org-agenda-use-time-grid nil)
                               (org-scheduled-past-days 0)
                               (org-deadline-warning-days 0)
                               (org-agenda-skip-scheduled-if-done t)
                               (org-agenda-skip-deadline-if-done t)
                               (org-log-note-clock-out t)
                               (org-agenda-todo-ignore-scheduled 'future)
                               (org-agenda-skip-function
                                '(z/org-agenda-select :todo-keywords '("NEXT")
                                                      :begin-scheduled-or-deadline "today"
                                                      :end-scheduled-or-deadline "today"))))
                   (agenda "" ((org-agenda-overriding-header "DONE")
                               (org-agenda-format-date "")
                               (org-agenda-span 'day)
                               (org-agenda-time-grid nil)
                               (org-agenda-use-time-grid nil)
                               (org-scheduled-past-days 0)
                               (org-deadline-warning-days 0)
                               (org-agenda-todo-ignore-scheduled 'future)
                               (org-agenda-skip-function
                                '(z/org-agenda-select :todo-keywords '("DONE" "ABORT")
                                                      :begin-scheduled-or-deadline "today"
                                                      :end-scheduled-or-deadline "today")))))))

   #+end_src

   clock 相关的设置
   #+BEGIN_SRC emacs-lisp
   (setq org-clock-into-drawer t)
   (setq org-log-note-clock-out t)
   (setq org-clock-mode-line-total 'current)
   #+END_SRC

   为方便清理和回顾，让各个任务能在各文件之间转接
   #+BEGIN_SRC emacs-lisp
   (setq org-refile-targets
         (append
          '(("~/Dropbox/org/inbox.org" :level . 1)
            ("~/Dropbox/org/journal/inbox.org" :level . 1)
            ("~/Dropbox/org/memo.org" :level . 1)
            ("~/Dropbox/org/ideas.org" :level . 1))
          (mapcar (lambda (file) (cons file (cons :level 1))) (directory-files "~/Dropbox/org/tasks/" t "org"))
          (mapcar (lambda (file) (cons file (cons :level 1))) (directory-files "~/Dropbox/org/notes/" t "org"))))
   #+END_SRC

   设置 org-refile-use-outline-path 为 *full-file-path* ，因为我有好几个文件都叫 inbox.org
   #+BEGIN_SRC emacs-lisp
   (setq org-refile-use-outline-path 'full-file-path)
   #+END_SRC

   from https://blog.aaronbieber.com/2017/03/19/organizing-notes-with-refile.html
   #+BEGIN_SRC emacs-lisp
   (setq org-outline-path-complete-in-steps nil)
   (setq org-completion-use-ido nil)
   #+END_SRC

   设置归档行为
   #+BEGIN_SRC emacs-lisp
   (setq org-archive-location "~/Dropbox/org/archives/archive.org::datetree/")
   #+END_SRC

   设置 helm-org-rifle
   #+BEGIN_SRC emacs-lisp
   ;; 在搜索结果中显示 heading 的全路径(包括文件名)
   (setq helm-org-rifle-show-path t)
   #+END_SRC

** 写作设置
   :PROPERTIES:
   :ID:       fa6fce86-42df-47ec-a3bc-609fc9121964
   :END:

   定义两个变量，用来存放文章和草稿
   #+begin_src emacs-lisp
   (defvar post-dir "~/Dropbox/org/blog/_posts/")
   (defvar microblog-dir "~/Dropbox/org/blog/_microblog/")
   (defvar draft-dir "~/Dropbox/org/blog/drafts/")
   #+end_src

   - TODO: 写一个函数，从指定目录中读取文章标题和文件名，然后塞给 helm 进行补全，最后可以打开指定的文件
   - TODO: 写两个函数，一个用来查找草稿，一个用来查找已写好的文章
   - TODO: 写一个函数，将草稿挪到 posts 目录中
   - TODO: 改进发布函数，发布的时候将文中提到的图片全部放到 blog 目录中，并修正图片路径

   #+BEGIN_SRC emacs-lisp
   (defun blog-post (title)
     (interactive "sEnter title: ")
     (let ((post-file (concat post-dir
                              (format-time-string "%Y-%m-%d")
                              "-"
                              title
                              ".org")))
       (progn
         (switch-to-buffer (find-file-noselect post-file))
         (insert (concat "#+startup: showall\n"
                         "#+options: toc:nil\n"
                         "#+begin_export html\n"
                         "---\n"
                         "layout     : post\n"
                         "title      : \n"
                         "desc       : \n"
                         "categories : \n"
                         "tags       : \n"
                         "---\n"
                         "#+end_export\n"
                         "#+TOC: headlines 2\n")))
       ))
   (defun publish-project (project no-cache)
     (interactive "sName of project: \nsNo-cache?[y/n] ")
     (if (or (string= no-cache "y")
             (string= no-cache "Y"))
         (setq org-publish-use-timestamps-flag nil))
     (org-publish-project project)
     (setq org-publish-use-timestamps-flag t))

      ;;;; PUBLISH(org)
   (setq org-export-default-language "zh-CN")
   (setq org-publish-project-alist
         '(("blog-org"
            ;; Path to your org files.
            :base-directory "~/Dropbox/org/blog/"
            :base-extension "org"
            ;; Path to your Jekyll project.
            :publishing-directory "~/Projects/github-pages/"
            :recursive t
            :htmlized-source t
            :section-numbers nil
            :publishing-function org-html-publish-to-html
            :headline-levels 4
            :html-extension "html"
            :body-only t; Only export section between <body> </body>
            :table-of-contents nil
            )
           ("blog-static"
            :base-directory "~/Dropbox/org/blog/"
            :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|php"
            :publishing-directory "~/Projects/github-pages/"
            :recursive t
            :publishing-function org-publish-attachment
            )
           ("blog" :components ("blog-org" "blog-static"))))

   #+END_SRC

   加一个 capture 设置用来写 microblog
   #+begin_src emacs-lisp
   (add-to-list 'org-capture-templates '("W" "Write"))
   (add-to-list 'org-capture-templates
                '("Wm" "Write microblog"
                  plain (file (lambda () (expand-file-name (concat microblog-dir (format-time-string "%s") ".org"))))
                  "#+startup: showall\n#+options: toc:nil\n#+begin_export html\n---\nlayout     : post\ndate       : %<%FT%T%z>\ntitle      : '闲言碎语 %<%Y-%m-%d %H:%M:%S>'\n---\n#+end_export\n\n%?"
                  :jump-to-captured t))
   #+end_src

   #+RESULTS:
   | Wm | Write microblog | plain | (file (lambda nil (expand-file-name (concat microblog-dir (format-time-string %s) .org)))) | #+startup: showall |

